/*
    -- Loop --
    while (  เงื่อนไข  ) {
        คำสั่ง...
    }
    +++++++++++++++++++++++++++++
    do{
        คำสั่ง...
    }while(  เงื่อนไข  );
    +++++++++++++++++++++++++++++
    for(  ตัวแปรพร้อมค่าเริ่มต้น ; เงื่อนไข ; การเพิ่มค่าตัวแปร  ){
        คำสั่ง...
    }
*/

#include <stdio.h>

int main(){
    int i=1;

    for(i = 1; i <=5; i++){
        printf("%d - Hello...", i);
    }
    printf("------------------\n");
    
    i = 1;
    while ( i <= 5 ){
        printf("%d - Hi...", i);
        i++;
    }
    printf("------------------\n");
    
    i = 1;
    do{
        printf("%d - Hey...", i);
        i++;
    }while ( i <= 5 );

}